# DS-SF-23 | Lab 02 - Introduction to `pandas`

(Source: [Computing for Data Analysis](https://www.coursera.org/course/compdata))

In [1]:
import os
import pandas as pd

In [2]:
df = pd.read_csv(os.path.join('..', 'datasets', 'ozone.csv'))

> ## Question 1.  Display the dataset's head

In [16]:
df.head(0) #insert number to show rows

Empty DataFrame
Columns: [Ozone, Solar.R, Wind, Temp, Month, Day]
Index: []

> ## Question 2.  Print the column names of the dataset to the screen, one column name per line

In [13]:
[[df.columns]]

[[Index([u'Ozone', u'Solar.R', u'Wind', u'Temp', u'Month', u'Day'], dtype='object')]]

> ## Question 3.  Extract the first 2 rows of the data frame and print them to the console. What does the output look like?

In [17]:
df.head(2)

   Ozone  Solar.R  Wind  Temp  Month  Day
0   41.0    190.0   7.4    67      5    1
1   36.0    118.0   8.0    72      5    2

> ## Question 4.  How many observations (i.e., rows) are in this data frame?

In [26]:
df.count().sum()

874

> ## Question 5.  Extract the last 2 rows of the data frame and print them to the console.  What does the output look like?

In [27]:
df.tail(2)

     Ozone  Solar.R  Wind  Temp  Month  Day
151   18.0    131.0   8.0    76      9   29
152   20.0    223.0  11.5    68      9   30

> ## Question 6. What is the value of Ozone in the 47th row?

In [28]:
df['Ozone'][47]

37.0

> ## Question 7. How many missing values are in the Ozone column of this data frame?

In [40]:
for i in df['Ozone']:
    if i == 'NaN':
        print i
print int(i)

20

> ## Question 8. What is the mean of the Ozone column in this dataset?  Exclude missing values (coded as NA) from this calculation

In [47]:
for i in df['Ozone']:
    number = int(i)

41
36
12
18

ValueError: cannot convert float NaN to integer

> ## Question 9. Extract the subset of rows of the data frame where Ozone values are above 31 and Temp values are above 90.  What is the mean of Solar.R in this subset?

> ## Question 10. What is the mean of Temp when Month is equal to 6?

> ## Question 11. What was the maximum Ozone value in the month of May?